000000 IDENTIFICATION DIVISION.
000001 PROGRAM-ID. LOVE.
000002 ENVIRONMENT DIVISION.  
000003 DATA DIVISION.
000004 
000005 WORKING-STORAGE SECTION.
000006 
000007 01  THE-NAME       PIC X(10).
000008 01  THE-MESSAGE    PIC X(10).
000009 
000010 PROCEDURE DIVISION.
000011 
000012     DISPLAY "PLEASE ENTER NAME: " WITH NO ADVANCING.
000013     ACCEPT THE-NAME.
000014
000015     MOVE "I LOVE YOU" TO THE-MESSAGE.
000016 
000017     DISPLAY "MESSAGE: " 
000018             THE-MESSAGE 
000019             " " 
000020             THE-NAME.
000021
000022     STOP RUN.
000023

