000000 IDENTIFICATION DIVISION.
000001 PROGRAM-ID. MULTABLE.
000002 ENVIRONMENT DIVISION.
000003 DATA DIVISION.
000004
000005 WORKING-STORAGE SECTION.
000006 
000007 01  THE-UNTIL            PIC 9(5). 
000008 01  THE-COUNTER          PIC 9(5) VALUE 1.
000009 01  THE-CONTENT-COUNTER  PIC 9(5).
000010 01  THE-VALUE            PIC 9(20). 
000011
000012 PROCEDURE DIVISION.
000013 
000014     DISPLAY "ENTER TABLE SIZE: " 
000015             WITH NO ADVANCING.
000016     ACCEPT THE-UNTIL.
000017 
000018     PERFORM PRINT-TABLE THE-UNTIL TIMES.
000019 
000020     STOP RUN.
000021 
000022
000023 PRINT-TABLE.
000024     DISPLAY "------------------------------------".
000025     DISPLAY THE-COUNTER
000026             " TABLE:".
000027     DISPLAY " ".
000028     
000029     MOVE 1 TO THE-CONTENT-COUNTER.
000030     PERFORM PRINT-TABLE-CONTENT THE-UNTIL TIMES. 
000031 
000032     ADD 1 TO THE-COUNTER.
000033 
000034
000035 PRINT-TABLE-CONTENT.
000036     COMPUTE THE-VALUE = THE-CONTENT-COUNTER * THE-COUNTER.      
000037     DISPLAY THE-CONTENT-COUNTER
000038             " * "
000039             THE-COUNTER
000040             " = "
000041             THE-VALUE.
000042     
000043     ADD 1 TO THE-CONTENT-COUNTER.
000044




